geo_logs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]

geo_logs2 = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Воронеж', 'Россия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']},
    {'visit11': ['Валдай', 'Россия']}
]

geo_logs3 = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Лиссабон', 'Португалия']},
    {'visit3': ['Париж', 'Франция']},
    {'visit4': ['Тула', 'Россия']},
    {'visit5': ['Архангельск', 'Россия']},
    {'visit6': ['Валдай', 'Россия']}
]

geo_logs_exp = [{'visit1': ['Москва', 'Россия']},
            {'visit3': ['Владимир', 'Россия']},
            {'visit7': ['Тула', 'Россия']},
            {'visit8': ['Тула', 'Россия']},
            {'visit9': ['Курск', 'Россия']},
            {'visit10': ['Архангельск', 'Россия']}]

geo_logs2_exp = [{'visit1': ['Москва', 'Россия']},
                 {'visit2': ['Воронеж', 'Россия']},
                 {'visit3': ['Владимир', 'Россия']},
                 {'visit7': ['Тула', 'Россия']},
                 {'visit8': ['Тула', 'Россия']},
                 {'visit9': ['Курск', 'Россия']},
                 {'visit10': ['Архангельск', 'Россия']},
                 {'visit11': ['Валдай', 'Россия']}]

geo_logs3_exp = [{'visit1': ['Москва', 'Россия']},
                 {'visit4': ['Тула', 'Россия']},
                 {'visit5': ['Архангельск', 'Россия']},
                 {'visit6': ['Валдай', 'Россия']}]

ids = {'user1': [213, 213, 213, 15, 213],
       'user2': [54, 54, 119, 119, 119],
       'user3': [213, 98, 98, 35]}

ids2 = {'user1': [213, 213, 213, 15, 213],
       'user2': [213, 98, 98, 35]}

ids_exp = {98, 35, 15, 213, 54, 119}

ids2_exp = {98, 35, 213, 15}

queries = [
    'смотреть сериалы онлайн',
    'новости спорта',
    'афиша кино',
    'курс доллара',
    'сериалы этим летом',
    'курс по питону',
    'сериалы про спорт',
]

stats = {'facebook': 55, 'yandex': 120, 'vk': 115, 'google': 99, 'email': 42, 'ok': 98}

stats2 = {'facebook': 55, 'yandex': 120, 'vk': 125, 'google': 99, 'email': 42, 'ok': 98}

stats3 = {'facebook': 55, 'google': 99, 'email': 42, 'ok': 98}

stats4 = {'email': 500, 'ok': 98}

stats_exp = 'yandex'

stats2_exp = 'vk'

stats3_exp = 'google'

stats4_exp = 'email'

